; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	infrared4 - mode
	infrared2 - mode
	image1 - mode
	spectrograph5 - mode
	image3 - mode
	infrared6 - mode
	thermograph0 - mode
	GroundStation0 - direction
	Star1 - direction
	Star2 - direction
	Star3 - direction
	GroundStation4 - direction
	GroundStation5 - direction
	GroundStation6 - direction
	GroundStation7 - direction
	Star8 - direction
	Star9 - direction
	Star10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
	Star14 - direction
)
(:init
	(supports instrument0 infrared2)
	(supports instrument0 thermograph0)
	(supports instrument0 image3)
	(supports instrument0 infrared6)
	(supports instrument0 spectrograph5)
	(supports instrument0 image1)
	(supports instrument0 infrared4)
	(calibration_target instrument0 Star10)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon12)
)
(:goal (and
	(pointing satellite0 GroundStation7)
	(have_image Planet11 infrared2)
	(have_image Phenomenon12 infrared6)
	(have_image Phenomenon13 infrared4)
	(have_image Phenomenon13 infrared2)
	(have_image Star14 image3)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 6
2. (turn_to satellite0 star10 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 star10)
   goals met: 0 of 6
3. (calibrate satellite0 instrument0 star10)
   added: (calibrated instrument0)
   goals met: 0 of 6
4. (turn_to satellite0 groundstation7 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 groundstation7)
   goals met: 1 of 6
5. (turn_to satellite0 phenomenon12 groundstation7)
   deleted: (pointing satellite0 groundstation7)
   added: (pointing satellite0 phenomenon12)
   goals met: 0 of 6
6. (take_image satellite0 phenomenon12 instrument0 infrared6)
   added: (have_image phenomenon12 infrared6)
   goals met: 1 of 6
7. (turn_to satellite0 groundstation7 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 groundstation7)
   goals met: 2 of 6
8. (turn_to satellite0 phenomenon13 groundstation7)
   deleted: (pointing satellite0 groundstation7)
   added: (pointing satellite0 phenomenon13)
   goals met: 1 of 6
9. (take_image satellite0 phenomenon13 instrument0 infrared2)
   added: (have_image phenomenon13 infrared2)
   goals met: 2 of 6
10. (take_image satellite0 phenomenon13 instrument0 infrared4)
   added: (have_image phenomenon13 infrared4)
   goals met: 3 of 6
11. (turn_to satellite0 groundstation7 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 groundstation7)
   goals met: 4 of 6
12. (turn_to satellite0 planet11 groundstation7)
   deleted: (pointing satellite0 groundstation7)
   added: (pointing satellite0 planet11)
   goals met: 3 of 6
13. (take_image satellite0 planet11 instrument0 infrared2)
   added: (have_image planet11 infrared2)
   goals met: 4 of 6
14. (turn_to satellite0 groundstation7 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 groundstation7)
   goals met: 5 of 6
15. (turn_to satellite0 star14 groundstation7)
   deleted: (pointing satellite0 groundstation7)
   added: (pointing satellite0 star14)
   goals met: 4 of 6
16. (take_image satellite0 star14 instrument0 image3)
   added: (have_image star14 image3)
   goals met: 5 of 6
17. (turn_to satellite0 groundstation7 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 groundstation7)
   goals met: 6 of 6
